###################################################################

# Created by write_sdc on Wed Dec 15 15:23:35 2021

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_max_transition 2 [current_design]
set_max_fanout 20 [current_design]
set_max_capacitance 0.4 [current_design]
set_load -pin_load 0.05 [get_ports phase_vld]
set_load -pin_load 0.05 [get_ports {phase[7]}]
set_load -pin_load 0.05 [get_ports {phase[6]}]
set_load -pin_load 0.05 [get_ports {phase[5]}]
set_load -pin_load 0.05 [get_ports {phase[4]}]
set_load -pin_load 0.05 [get_ports {phase[3]}]
set_load -pin_load 0.05 [get_ports {phase[2]}]
set_load -pin_load 0.05 [get_ports {phase[1]}]
set_load -pin_load 0.05 [get_ports {phase[0]}]
create_clock [get_ports clk]  -period 10  -waveform {0 5}
set_clock_latency 1  [get_clocks clk]
set_clock_latency -source 1  [get_clocks clk]
set_clock_uncertainty 1  [get_clocks clk]
set_clock_transition -min -fall 1 [get_clocks clk]
set_clock_transition -min -rise 1 [get_clocks clk]
set_clock_transition -max -fall 1 [get_clocks clk]
set_clock_transition -max -rise 1 [get_clocks clk]
group_path -name INPUT_GROUP  -from [list [get_ports rg_calphase_en] [get_ports rg_bypass_mean] [get_ports  \
{rg_cordic_iternum[2]}] [get_ports {rg_cordic_iternum[1]}] [get_ports          \
{rg_cordic_iternum[0]}] [get_ports {rg_leakage_table_0[7]}] [get_ports         \
{rg_leakage_table_0[6]}] [get_ports {rg_leakage_table_0[5]}] [get_ports        \
{rg_leakage_table_0[4]}] [get_ports {rg_leakage_table_0[3]}] [get_ports        \
{rg_leakage_table_0[2]}] [get_ports {rg_leakage_table_0[1]}] [get_ports        \
{rg_leakage_table_0[0]}] [get_ports {rg_leakage_table_1[7]}] [get_ports        \
{rg_leakage_table_1[6]}] [get_ports {rg_leakage_table_1[5]}] [get_ports        \
{rg_leakage_table_1[4]}] [get_ports {rg_leakage_table_1[3]}] [get_ports        \
{rg_leakage_table_1[2]}] [get_ports {rg_leakage_table_1[1]}] [get_ports        \
{rg_leakage_table_1[0]}] [get_ports {rg_leakage_table_2[7]}] [get_ports        \
{rg_leakage_table_2[6]}] [get_ports {rg_leakage_table_2[5]}] [get_ports        \
{rg_leakage_table_2[4]}] [get_ports {rg_leakage_table_2[3]}] [get_ports        \
{rg_leakage_table_2[2]}] [get_ports {rg_leakage_table_2[1]}] [get_ports        \
{rg_leakage_table_2[0]}] [get_ports {rg_leakage_table_3[7]}] [get_ports        \
{rg_leakage_table_3[6]}] [get_ports {rg_leakage_table_3[5]}] [get_ports        \
{rg_leakage_table_3[4]}] [get_ports {rg_leakage_table_3[3]}] [get_ports        \
{rg_leakage_table_3[2]}] [get_ports {rg_leakage_table_3[1]}] [get_ports        \
{rg_leakage_table_3[0]}] [get_ports {rg_leakage_table_4[7]}] [get_ports        \
{rg_leakage_table_4[6]}] [get_ports {rg_leakage_table_4[5]}] [get_ports        \
{rg_leakage_table_4[4]}] [get_ports {rg_leakage_table_4[3]}] [get_ports        \
{rg_leakage_table_4[2]}] [get_ports {rg_leakage_table_4[1]}] [get_ports        \
{rg_leakage_table_4[0]}] [get_ports {rg_leakage_table_5[7]}] [get_ports        \
{rg_leakage_table_5[6]}] [get_ports {rg_leakage_table_5[5]}] [get_ports        \
{rg_leakage_table_5[4]}] [get_ports {rg_leakage_table_5[3]}] [get_ports        \
{rg_leakage_table_5[2]}] [get_ports {rg_leakage_table_5[1]}] [get_ports        \
{rg_leakage_table_5[0]}] [get_ports {rg_leakage_table_6[7]}] [get_ports        \
{rg_leakage_table_6[6]}] [get_ports {rg_leakage_table_6[5]}] [get_ports        \
{rg_leakage_table_6[4]}] [get_ports {rg_leakage_table_6[3]}] [get_ports        \
{rg_leakage_table_6[2]}] [get_ports {rg_leakage_table_6[1]}] [get_ports        \
{rg_leakage_table_6[0]}] [get_ports {rg_leakage_table_7[7]}] [get_ports        \
{rg_leakage_table_7[6]}] [get_ports {rg_leakage_table_7[5]}] [get_ports        \
{rg_leakage_table_7[4]}] [get_ports {rg_leakage_table_7[3]}] [get_ports        \
{rg_leakage_table_7[2]}] [get_ports {rg_leakage_table_7[1]}] [get_ports        \
{rg_leakage_table_7[0]}] [get_ports {rg_sin_table_0[7]}] [get_ports            \
{rg_sin_table_0[6]}] [get_ports {rg_sin_table_0[5]}] [get_ports                \
{rg_sin_table_0[4]}] [get_ports {rg_sin_table_0[3]}] [get_ports                \
{rg_sin_table_0[2]}] [get_ports {rg_sin_table_0[1]}] [get_ports                \
{rg_sin_table_0[0]}] [get_ports {rg_sin_table_1[7]}] [get_ports                \
{rg_sin_table_1[6]}] [get_ports {rg_sin_table_1[5]}] [get_ports                \
{rg_sin_table_1[4]}] [get_ports {rg_sin_table_1[3]}] [get_ports                \
{rg_sin_table_1[2]}] [get_ports {rg_sin_table_1[1]}] [get_ports                \
{rg_sin_table_1[0]}] [get_ports {rg_sin_table_2[7]}] [get_ports                \
{rg_sin_table_2[6]}] [get_ports {rg_sin_table_2[5]}] [get_ports                \
{rg_sin_table_2[4]}] [get_ports {rg_sin_table_2[3]}] [get_ports                \
{rg_sin_table_2[2]}] [get_ports {rg_sin_table_2[1]}] [get_ports                \
{rg_sin_table_2[0]}] [get_ports {rg_sin_table_3[7]}] [get_ports                \
{rg_sin_table_3[6]}] [get_ports {rg_sin_table_3[5]}] [get_ports                \
{rg_sin_table_3[4]}] [get_ports {rg_sin_table_3[3]}] [get_ports                \
{rg_sin_table_3[2]}] [get_ports {rg_sin_table_3[1]}] [get_ports                \
{rg_sin_table_3[0]}] [get_ports {rg_sin_table_4[7]}] [get_ports                \
{rg_sin_table_4[6]}] [get_ports {rg_sin_table_4[5]}] [get_ports                \
{rg_sin_table_4[4]}] [get_ports {rg_sin_table_4[3]}] [get_ports                \
{rg_sin_table_4[2]}] [get_ports {rg_sin_table_4[1]}] [get_ports                \
{rg_sin_table_4[0]}] [get_ports {rg_sin_table_5[7]}] [get_ports                \
{rg_sin_table_5[6]}] [get_ports {rg_sin_table_5[5]}] [get_ports                \
{rg_sin_table_5[4]}] [get_ports {rg_sin_table_5[3]}] [get_ports                \
{rg_sin_table_5[2]}] [get_ports {rg_sin_table_5[1]}] [get_ports                \
{rg_sin_table_5[0]}] [get_ports {rg_sin_table_6[7]}] [get_ports                \
{rg_sin_table_6[6]}] [get_ports {rg_sin_table_6[5]}] [get_ports                \
{rg_sin_table_6[4]}] [get_ports {rg_sin_table_6[3]}] [get_ports                \
{rg_sin_table_6[2]}] [get_ports {rg_sin_table_6[1]}] [get_ports                \
{rg_sin_table_6[0]}] [get_ports {rg_sin_table_7[7]}] [get_ports                \
{rg_sin_table_7[6]}] [get_ports {rg_sin_table_7[5]}] [get_ports                \
{rg_sin_table_7[4]}] [get_ports {rg_sin_table_7[3]}] [get_ports                \
{rg_sin_table_7[2]}] [get_ports {rg_sin_table_7[1]}] [get_ports                \
{rg_sin_table_7[0]}] [get_ports {rg_cos_table_0[7]}] [get_ports                \
{rg_cos_table_0[6]}] [get_ports {rg_cos_table_0[5]}] [get_ports                \
{rg_cos_table_0[4]}] [get_ports {rg_cos_table_0[3]}] [get_ports                \
{rg_cos_table_0[2]}] [get_ports {rg_cos_table_0[1]}] [get_ports                \
{rg_cos_table_0[0]}] [get_ports {rg_cos_table_1[7]}] [get_ports                \
{rg_cos_table_1[6]}] [get_ports {rg_cos_table_1[5]}] [get_ports                \
{rg_cos_table_1[4]}] [get_ports {rg_cos_table_1[3]}] [get_ports                \
{rg_cos_table_1[2]}] [get_ports {rg_cos_table_1[1]}] [get_ports                \
{rg_cos_table_1[0]}] [get_ports {rg_cos_table_2[7]}] [get_ports                \
{rg_cos_table_2[6]}] [get_ports {rg_cos_table_2[5]}] [get_ports                \
{rg_cos_table_2[4]}] [get_ports {rg_cos_table_2[3]}] [get_ports                \
{rg_cos_table_2[2]}] [get_ports {rg_cos_table_2[1]}] [get_ports                \
{rg_cos_table_2[0]}] [get_ports {rg_cos_table_3[7]}] [get_ports                \
{rg_cos_table_3[6]}] [get_ports {rg_cos_table_3[5]}] [get_ports                \
{rg_cos_table_3[4]}] [get_ports {rg_cos_table_3[3]}] [get_ports                \
{rg_cos_table_3[2]}] [get_ports {rg_cos_table_3[1]}] [get_ports                \
{rg_cos_table_3[0]}] [get_ports {rg_cos_table_4[7]}] [get_ports                \
{rg_cos_table_4[6]}] [get_ports {rg_cos_table_4[5]}] [get_ports                \
{rg_cos_table_4[4]}] [get_ports {rg_cos_table_4[3]}] [get_ports                \
{rg_cos_table_4[2]}] [get_ports {rg_cos_table_4[1]}] [get_ports                \
{rg_cos_table_4[0]}] [get_ports {rg_cos_table_5[7]}] [get_ports                \
{rg_cos_table_5[6]}] [get_ports {rg_cos_table_5[5]}] [get_ports                \
{rg_cos_table_5[4]}] [get_ports {rg_cos_table_5[3]}] [get_ports                \
{rg_cos_table_5[2]}] [get_ports {rg_cos_table_5[1]}] [get_ports                \
{rg_cos_table_5[0]}] [get_ports {rg_cos_table_6[7]}] [get_ports                \
{rg_cos_table_6[6]}] [get_ports {rg_cos_table_6[5]}] [get_ports                \
{rg_cos_table_6[4]}] [get_ports {rg_cos_table_6[3]}] [get_ports                \
{rg_cos_table_6[2]}] [get_ports {rg_cos_table_6[1]}] [get_ports                \
{rg_cos_table_6[0]}] [get_ports {rg_cos_table_7[7]}] [get_ports                \
{rg_cos_table_7[6]}] [get_ports {rg_cos_table_7[5]}] [get_ports                \
{rg_cos_table_7[4]}] [get_ports {rg_cos_table_7[3]}] [get_ports                \
{rg_cos_table_7[2]}] [get_ports {rg_cos_table_7[1]}] [get_ports                \
{rg_cos_table_7[0]}] [get_ports {valid_num[2]}] [get_ports {valid_num[1]}]     \
[get_ports {valid_num[0]}] [get_ports vin_vld] [get_ports {vin1[7]}]           \
[get_ports {vin1[6]}] [get_ports {vin1[5]}] [get_ports {vin1[4]}] [get_ports   \
{vin1[3]}] [get_ports {vin1[2]}] [get_ports {vin1[1]}] [get_ports {vin1[0]}]   \
[get_ports {vin2[7]}] [get_ports {vin2[6]}] [get_ports {vin2[5]}] [get_ports   \
{vin2[4]}] [get_ports {vin2[3]}] [get_ports {vin2[2]}] [get_ports {vin2[1]}]   \
[get_ports {vin2[0]}] [get_ports clk] [get_ports resetn]]
group_path -name OUTPUT_GROUP  -to [list [get_ports phase_vld] [get_ports {phase[7]}] [get_ports {phase[6]}] \
[get_ports {phase[5]}] [get_ports {phase[4]}] [get_ports {phase[3]}]           \
[get_ports {phase[2]}] [get_ports {phase[1]}] [get_ports {phase[0]}]]
set_input_delay -clock clk  4  [get_ports rg_calphase_en]
set_input_delay -clock clk  4  [get_ports rg_bypass_mean]
set_input_delay -clock clk  4  [get_ports {rg_cordic_iternum[2]}]
set_input_delay -clock clk  4  [get_ports {rg_cordic_iternum[1]}]
set_input_delay -clock clk  4  [get_ports {rg_cordic_iternum[0]}]
set_input_delay -clock clk  4  [get_ports {rg_leakage_table_0[7]}]
set_input_delay -clock clk  4  [get_ports {rg_leakage_table_0[6]}]
set_input_delay -clock clk  4  [get_ports {rg_leakage_table_0[5]}]
set_input_delay -clock clk  4  [get_ports {rg_leakage_table_0[4]}]
set_input_delay -clock clk  4  [get_ports {rg_leakage_table_0[3]}]
set_input_delay -clock clk  4  [get_ports {rg_leakage_table_0[2]}]
set_input_delay -clock clk  4  [get_ports {rg_leakage_table_0[1]}]
set_input_delay -clock clk  4  [get_ports {rg_leakage_table_0[0]}]
set_input_delay -clock clk  4  [get_ports {rg_leakage_table_1[7]}]
set_input_delay -clock clk  4  [get_ports {rg_leakage_table_1[6]}]
set_input_delay -clock clk  4  [get_ports {rg_leakage_table_1[5]}]
set_input_delay -clock clk  4  [get_ports {rg_leakage_table_1[4]}]
set_input_delay -clock clk  4  [get_ports {rg_leakage_table_1[3]}]
set_input_delay -clock clk  4  [get_ports {rg_leakage_table_1[2]}]
set_input_delay -clock clk  4  [get_ports {rg_leakage_table_1[1]}]
set_input_delay -clock clk  4  [get_ports {rg_leakage_table_1[0]}]
set_input_delay -clock clk  4  [get_ports {rg_leakage_table_2[7]}]
set_input_delay -clock clk  4  [get_ports {rg_leakage_table_2[6]}]
set_input_delay -clock clk  4  [get_ports {rg_leakage_table_2[5]}]
set_input_delay -clock clk  4  [get_ports {rg_leakage_table_2[4]}]
set_input_delay -clock clk  4  [get_ports {rg_leakage_table_2[3]}]
set_input_delay -clock clk  4  [get_ports {rg_leakage_table_2[2]}]
set_input_delay -clock clk  4  [get_ports {rg_leakage_table_2[1]}]
set_input_delay -clock clk  4  [get_ports {rg_leakage_table_2[0]}]
set_input_delay -clock clk  4  [get_ports {rg_leakage_table_3[7]}]
set_input_delay -clock clk  4  [get_ports {rg_leakage_table_3[6]}]
set_input_delay -clock clk  4  [get_ports {rg_leakage_table_3[5]}]
set_input_delay -clock clk  4  [get_ports {rg_leakage_table_3[4]}]
set_input_delay -clock clk  4  [get_ports {rg_leakage_table_3[3]}]
set_input_delay -clock clk  4  [get_ports {rg_leakage_table_3[2]}]
set_input_delay -clock clk  4  [get_ports {rg_leakage_table_3[1]}]
set_input_delay -clock clk  4  [get_ports {rg_leakage_table_3[0]}]
set_input_delay -clock clk  4  [get_ports {rg_leakage_table_4[7]}]
set_input_delay -clock clk  4  [get_ports {rg_leakage_table_4[6]}]
set_input_delay -clock clk  4  [get_ports {rg_leakage_table_4[5]}]
set_input_delay -clock clk  4  [get_ports {rg_leakage_table_4[4]}]
set_input_delay -clock clk  4  [get_ports {rg_leakage_table_4[3]}]
set_input_delay -clock clk  4  [get_ports {rg_leakage_table_4[2]}]
set_input_delay -clock clk  4  [get_ports {rg_leakage_table_4[1]}]
set_input_delay -clock clk  4  [get_ports {rg_leakage_table_4[0]}]
set_input_delay -clock clk  4  [get_ports {rg_leakage_table_5[7]}]
set_input_delay -clock clk  4  [get_ports {rg_leakage_table_5[6]}]
set_input_delay -clock clk  4  [get_ports {rg_leakage_table_5[5]}]
set_input_delay -clock clk  4  [get_ports {rg_leakage_table_5[4]}]
set_input_delay -clock clk  4  [get_ports {rg_leakage_table_5[3]}]
set_input_delay -clock clk  4  [get_ports {rg_leakage_table_5[2]}]
set_input_delay -clock clk  4  [get_ports {rg_leakage_table_5[1]}]
set_input_delay -clock clk  4  [get_ports {rg_leakage_table_5[0]}]
set_input_delay -clock clk  4  [get_ports {rg_leakage_table_6[7]}]
set_input_delay -clock clk  4  [get_ports {rg_leakage_table_6[6]}]
set_input_delay -clock clk  4  [get_ports {rg_leakage_table_6[5]}]
set_input_delay -clock clk  4  [get_ports {rg_leakage_table_6[4]}]
set_input_delay -clock clk  4  [get_ports {rg_leakage_table_6[3]}]
set_input_delay -clock clk  4  [get_ports {rg_leakage_table_6[2]}]
set_input_delay -clock clk  4  [get_ports {rg_leakage_table_6[1]}]
set_input_delay -clock clk  4  [get_ports {rg_leakage_table_6[0]}]
set_input_delay -clock clk  4  [get_ports {rg_leakage_table_7[7]}]
set_input_delay -clock clk  4  [get_ports {rg_leakage_table_7[6]}]
set_input_delay -clock clk  4  [get_ports {rg_leakage_table_7[5]}]
set_input_delay -clock clk  4  [get_ports {rg_leakage_table_7[4]}]
set_input_delay -clock clk  4  [get_ports {rg_leakage_table_7[3]}]
set_input_delay -clock clk  4  [get_ports {rg_leakage_table_7[2]}]
set_input_delay -clock clk  4  [get_ports {rg_leakage_table_7[1]}]
set_input_delay -clock clk  4  [get_ports {rg_leakage_table_7[0]}]
set_input_delay -clock clk  4  [get_ports {rg_sin_table_0[7]}]
set_input_delay -clock clk  4  [get_ports {rg_sin_table_0[6]}]
set_input_delay -clock clk  4  [get_ports {rg_sin_table_0[5]}]
set_input_delay -clock clk  4  [get_ports {rg_sin_table_0[4]}]
set_input_delay -clock clk  4  [get_ports {rg_sin_table_0[3]}]
set_input_delay -clock clk  4  [get_ports {rg_sin_table_0[2]}]
set_input_delay -clock clk  4  [get_ports {rg_sin_table_0[1]}]
set_input_delay -clock clk  4  [get_ports {rg_sin_table_0[0]}]
set_input_delay -clock clk  4  [get_ports {rg_sin_table_1[7]}]
set_input_delay -clock clk  4  [get_ports {rg_sin_table_1[6]}]
set_input_delay -clock clk  4  [get_ports {rg_sin_table_1[5]}]
set_input_delay -clock clk  4  [get_ports {rg_sin_table_1[4]}]
set_input_delay -clock clk  4  [get_ports {rg_sin_table_1[3]}]
set_input_delay -clock clk  4  [get_ports {rg_sin_table_1[2]}]
set_input_delay -clock clk  4  [get_ports {rg_sin_table_1[1]}]
set_input_delay -clock clk  4  [get_ports {rg_sin_table_1[0]}]
set_input_delay -clock clk  4  [get_ports {rg_sin_table_2[7]}]
set_input_delay -clock clk  4  [get_ports {rg_sin_table_2[6]}]
set_input_delay -clock clk  4  [get_ports {rg_sin_table_2[5]}]
set_input_delay -clock clk  4  [get_ports {rg_sin_table_2[4]}]
set_input_delay -clock clk  4  [get_ports {rg_sin_table_2[3]}]
set_input_delay -clock clk  4  [get_ports {rg_sin_table_2[2]}]
set_input_delay -clock clk  4  [get_ports {rg_sin_table_2[1]}]
set_input_delay -clock clk  4  [get_ports {rg_sin_table_2[0]}]
set_input_delay -clock clk  4  [get_ports {rg_sin_table_3[7]}]
set_input_delay -clock clk  4  [get_ports {rg_sin_table_3[6]}]
set_input_delay -clock clk  4  [get_ports {rg_sin_table_3[5]}]
set_input_delay -clock clk  4  [get_ports {rg_sin_table_3[4]}]
set_input_delay -clock clk  4  [get_ports {rg_sin_table_3[3]}]
set_input_delay -clock clk  4  [get_ports {rg_sin_table_3[2]}]
set_input_delay -clock clk  4  [get_ports {rg_sin_table_3[1]}]
set_input_delay -clock clk  4  [get_ports {rg_sin_table_3[0]}]
set_input_delay -clock clk  4  [get_ports {rg_sin_table_4[7]}]
set_input_delay -clock clk  4  [get_ports {rg_sin_table_4[6]}]
set_input_delay -clock clk  4  [get_ports {rg_sin_table_4[5]}]
set_input_delay -clock clk  4  [get_ports {rg_sin_table_4[4]}]
set_input_delay -clock clk  4  [get_ports {rg_sin_table_4[3]}]
set_input_delay -clock clk  4  [get_ports {rg_sin_table_4[2]}]
set_input_delay -clock clk  4  [get_ports {rg_sin_table_4[1]}]
set_input_delay -clock clk  4  [get_ports {rg_sin_table_4[0]}]
set_input_delay -clock clk  4  [get_ports {rg_sin_table_5[7]}]
set_input_delay -clock clk  4  [get_ports {rg_sin_table_5[6]}]
set_input_delay -clock clk  4  [get_ports {rg_sin_table_5[5]}]
set_input_delay -clock clk  4  [get_ports {rg_sin_table_5[4]}]
set_input_delay -clock clk  4  [get_ports {rg_sin_table_5[3]}]
set_input_delay -clock clk  4  [get_ports {rg_sin_table_5[2]}]
set_input_delay -clock clk  4  [get_ports {rg_sin_table_5[1]}]
set_input_delay -clock clk  4  [get_ports {rg_sin_table_5[0]}]
set_input_delay -clock clk  4  [get_ports {rg_sin_table_6[7]}]
set_input_delay -clock clk  4  [get_ports {rg_sin_table_6[6]}]
set_input_delay -clock clk  4  [get_ports {rg_sin_table_6[5]}]
set_input_delay -clock clk  4  [get_ports {rg_sin_table_6[4]}]
set_input_delay -clock clk  4  [get_ports {rg_sin_table_6[3]}]
set_input_delay -clock clk  4  [get_ports {rg_sin_table_6[2]}]
set_input_delay -clock clk  4  [get_ports {rg_sin_table_6[1]}]
set_input_delay -clock clk  4  [get_ports {rg_sin_table_6[0]}]
set_input_delay -clock clk  4  [get_ports {rg_sin_table_7[7]}]
set_input_delay -clock clk  4  [get_ports {rg_sin_table_7[6]}]
set_input_delay -clock clk  4  [get_ports {rg_sin_table_7[5]}]
set_input_delay -clock clk  4  [get_ports {rg_sin_table_7[4]}]
set_input_delay -clock clk  4  [get_ports {rg_sin_table_7[3]}]
set_input_delay -clock clk  4  [get_ports {rg_sin_table_7[2]}]
set_input_delay -clock clk  4  [get_ports {rg_sin_table_7[1]}]
set_input_delay -clock clk  4  [get_ports {rg_sin_table_7[0]}]
set_input_delay -clock clk  4  [get_ports {rg_cos_table_0[7]}]
set_input_delay -clock clk  4  [get_ports {rg_cos_table_0[6]}]
set_input_delay -clock clk  4  [get_ports {rg_cos_table_0[5]}]
set_input_delay -clock clk  4  [get_ports {rg_cos_table_0[4]}]
set_input_delay -clock clk  4  [get_ports {rg_cos_table_0[3]}]
set_input_delay -clock clk  4  [get_ports {rg_cos_table_0[2]}]
set_input_delay -clock clk  4  [get_ports {rg_cos_table_0[1]}]
set_input_delay -clock clk  4  [get_ports {rg_cos_table_0[0]}]
set_input_delay -clock clk  4  [get_ports {rg_cos_table_1[7]}]
set_input_delay -clock clk  4  [get_ports {rg_cos_table_1[6]}]
set_input_delay -clock clk  4  [get_ports {rg_cos_table_1[5]}]
set_input_delay -clock clk  4  [get_ports {rg_cos_table_1[4]}]
set_input_delay -clock clk  4  [get_ports {rg_cos_table_1[3]}]
set_input_delay -clock clk  4  [get_ports {rg_cos_table_1[2]}]
set_input_delay -clock clk  4  [get_ports {rg_cos_table_1[1]}]
set_input_delay -clock clk  4  [get_ports {rg_cos_table_1[0]}]
set_input_delay -clock clk  4  [get_ports {rg_cos_table_2[7]}]
set_input_delay -clock clk  4  [get_ports {rg_cos_table_2[6]}]
set_input_delay -clock clk  4  [get_ports {rg_cos_table_2[5]}]
set_input_delay -clock clk  4  [get_ports {rg_cos_table_2[4]}]
set_input_delay -clock clk  4  [get_ports {rg_cos_table_2[3]}]
set_input_delay -clock clk  4  [get_ports {rg_cos_table_2[2]}]
set_input_delay -clock clk  4  [get_ports {rg_cos_table_2[1]}]
set_input_delay -clock clk  4  [get_ports {rg_cos_table_2[0]}]
set_input_delay -clock clk  4  [get_ports {rg_cos_table_3[7]}]
set_input_delay -clock clk  4  [get_ports {rg_cos_table_3[6]}]
set_input_delay -clock clk  4  [get_ports {rg_cos_table_3[5]}]
set_input_delay -clock clk  4  [get_ports {rg_cos_table_3[4]}]
set_input_delay -clock clk  4  [get_ports {rg_cos_table_3[3]}]
set_input_delay -clock clk  4  [get_ports {rg_cos_table_3[2]}]
set_input_delay -clock clk  4  [get_ports {rg_cos_table_3[1]}]
set_input_delay -clock clk  4  [get_ports {rg_cos_table_3[0]}]
set_input_delay -clock clk  4  [get_ports {rg_cos_table_4[7]}]
set_input_delay -clock clk  4  [get_ports {rg_cos_table_4[6]}]
set_input_delay -clock clk  4  [get_ports {rg_cos_table_4[5]}]
set_input_delay -clock clk  4  [get_ports {rg_cos_table_4[4]}]
set_input_delay -clock clk  4  [get_ports {rg_cos_table_4[3]}]
set_input_delay -clock clk  4  [get_ports {rg_cos_table_4[2]}]
set_input_delay -clock clk  4  [get_ports {rg_cos_table_4[1]}]
set_input_delay -clock clk  4  [get_ports {rg_cos_table_4[0]}]
set_input_delay -clock clk  4  [get_ports {rg_cos_table_5[7]}]
set_input_delay -clock clk  4  [get_ports {rg_cos_table_5[6]}]
set_input_delay -clock clk  4  [get_ports {rg_cos_table_5[5]}]
set_input_delay -clock clk  4  [get_ports {rg_cos_table_5[4]}]
set_input_delay -clock clk  4  [get_ports {rg_cos_table_5[3]}]
set_input_delay -clock clk  4  [get_ports {rg_cos_table_5[2]}]
set_input_delay -clock clk  4  [get_ports {rg_cos_table_5[1]}]
set_input_delay -clock clk  4  [get_ports {rg_cos_table_5[0]}]
set_input_delay -clock clk  4  [get_ports {rg_cos_table_6[7]}]
set_input_delay -clock clk  4  [get_ports {rg_cos_table_6[6]}]
set_input_delay -clock clk  4  [get_ports {rg_cos_table_6[5]}]
set_input_delay -clock clk  4  [get_ports {rg_cos_table_6[4]}]
set_input_delay -clock clk  4  [get_ports {rg_cos_table_6[3]}]
set_input_delay -clock clk  4  [get_ports {rg_cos_table_6[2]}]
set_input_delay -clock clk  4  [get_ports {rg_cos_table_6[1]}]
set_input_delay -clock clk  4  [get_ports {rg_cos_table_6[0]}]
set_input_delay -clock clk  4  [get_ports {rg_cos_table_7[7]}]
set_input_delay -clock clk  4  [get_ports {rg_cos_table_7[6]}]
set_input_delay -clock clk  4  [get_ports {rg_cos_table_7[5]}]
set_input_delay -clock clk  4  [get_ports {rg_cos_table_7[4]}]
set_input_delay -clock clk  4  [get_ports {rg_cos_table_7[3]}]
set_input_delay -clock clk  4  [get_ports {rg_cos_table_7[2]}]
set_input_delay -clock clk  4  [get_ports {rg_cos_table_7[1]}]
set_input_delay -clock clk  4  [get_ports {rg_cos_table_7[0]}]
set_input_delay -clock clk  4  [get_ports {valid_num[2]}]
set_input_delay -clock clk  4  [get_ports {valid_num[1]}]
set_input_delay -clock clk  4  [get_ports {valid_num[0]}]
set_input_delay -clock clk  4  [get_ports vin_vld]
set_input_delay -clock clk  4  [get_ports {vin1[7]}]
set_input_delay -clock clk  4  [get_ports {vin1[6]}]
set_input_delay -clock clk  4  [get_ports {vin1[5]}]
set_input_delay -clock clk  4  [get_ports {vin1[4]}]
set_input_delay -clock clk  4  [get_ports {vin1[3]}]
set_input_delay -clock clk  4  [get_ports {vin1[2]}]
set_input_delay -clock clk  4  [get_ports {vin1[1]}]
set_input_delay -clock clk  4  [get_ports {vin1[0]}]
set_input_delay -clock clk  4  [get_ports {vin2[7]}]
set_input_delay -clock clk  4  [get_ports {vin2[6]}]
set_input_delay -clock clk  4  [get_ports {vin2[5]}]
set_input_delay -clock clk  4  [get_ports {vin2[4]}]
set_input_delay -clock clk  4  [get_ports {vin2[3]}]
set_input_delay -clock clk  4  [get_ports {vin2[2]}]
set_input_delay -clock clk  4  [get_ports {vin2[1]}]
set_input_delay -clock clk  4  [get_ports {vin2[0]}]
set_input_delay -clock clk  4  [get_ports resetn]
set_output_delay -clock clk  6  [get_ports phase_vld]
set_output_delay -clock clk  6  [get_ports {phase[7]}]
set_output_delay -clock clk  6  [get_ports {phase[6]}]
set_output_delay -clock clk  6  [get_ports {phase[5]}]
set_output_delay -clock clk  6  [get_ports {phase[4]}]
set_output_delay -clock clk  6  [get_ports {phase[3]}]
set_output_delay -clock clk  6  [get_ports {phase[2]}]
set_output_delay -clock clk  6  [get_ports {phase[1]}]
set_output_delay -clock clk  6  [get_ports {phase[0]}]
set_input_transition -max 1  [get_ports rg_calphase_en]
set_input_transition -min 1  [get_ports rg_calphase_en]
set_input_transition -max 1  [get_ports rg_bypass_mean]
set_input_transition -min 1  [get_ports rg_bypass_mean]
set_input_transition -max 1  [get_ports {rg_cordic_iternum[2]}]
set_input_transition -min 1  [get_ports {rg_cordic_iternum[2]}]
set_input_transition -max 1  [get_ports {rg_cordic_iternum[1]}]
set_input_transition -min 1  [get_ports {rg_cordic_iternum[1]}]
set_input_transition -max 1  [get_ports {rg_cordic_iternum[0]}]
set_input_transition -min 1  [get_ports {rg_cordic_iternum[0]}]
set_input_transition -max 1  [get_ports {rg_leakage_table_0[7]}]
set_input_transition -min 1  [get_ports {rg_leakage_table_0[7]}]
set_input_transition -max 1  [get_ports {rg_leakage_table_0[6]}]
set_input_transition -min 1  [get_ports {rg_leakage_table_0[6]}]
set_input_transition -max 1  [get_ports {rg_leakage_table_0[5]}]
set_input_transition -min 1  [get_ports {rg_leakage_table_0[5]}]
set_input_transition -max 1  [get_ports {rg_leakage_table_0[4]}]
set_input_transition -min 1  [get_ports {rg_leakage_table_0[4]}]
set_input_transition -max 1  [get_ports {rg_leakage_table_0[3]}]
set_input_transition -min 1  [get_ports {rg_leakage_table_0[3]}]
set_input_transition -max 1  [get_ports {rg_leakage_table_0[2]}]
set_input_transition -min 1  [get_ports {rg_leakage_table_0[2]}]
set_input_transition -max 1  [get_ports {rg_leakage_table_0[1]}]
set_input_transition -min 1  [get_ports {rg_leakage_table_0[1]}]
set_input_transition -max 1  [get_ports {rg_leakage_table_0[0]}]
set_input_transition -min 1  [get_ports {rg_leakage_table_0[0]}]
set_input_transition -max 1  [get_ports {rg_leakage_table_1[7]}]
set_input_transition -min 1  [get_ports {rg_leakage_table_1[7]}]
set_input_transition -max 1  [get_ports {rg_leakage_table_1[6]}]
set_input_transition -min 1  [get_ports {rg_leakage_table_1[6]}]
set_input_transition -max 1  [get_ports {rg_leakage_table_1[5]}]
set_input_transition -min 1  [get_ports {rg_leakage_table_1[5]}]
set_input_transition -max 1  [get_ports {rg_leakage_table_1[4]}]
set_input_transition -min 1  [get_ports {rg_leakage_table_1[4]}]
set_input_transition -max 1  [get_ports {rg_leakage_table_1[3]}]
set_input_transition -min 1  [get_ports {rg_leakage_table_1[3]}]
set_input_transition -max 1  [get_ports {rg_leakage_table_1[2]}]
set_input_transition -min 1  [get_ports {rg_leakage_table_1[2]}]
set_input_transition -max 1  [get_ports {rg_leakage_table_1[1]}]
set_input_transition -min 1  [get_ports {rg_leakage_table_1[1]}]
set_input_transition -max 1  [get_ports {rg_leakage_table_1[0]}]
set_input_transition -min 1  [get_ports {rg_leakage_table_1[0]}]
set_input_transition -max 1  [get_ports {rg_leakage_table_2[7]}]
set_input_transition -min 1  [get_ports {rg_leakage_table_2[7]}]
set_input_transition -max 1  [get_ports {rg_leakage_table_2[6]}]
set_input_transition -min 1  [get_ports {rg_leakage_table_2[6]}]
set_input_transition -max 1  [get_ports {rg_leakage_table_2[5]}]
set_input_transition -min 1  [get_ports {rg_leakage_table_2[5]}]
set_input_transition -max 1  [get_ports {rg_leakage_table_2[4]}]
set_input_transition -min 1  [get_ports {rg_leakage_table_2[4]}]
set_input_transition -max 1  [get_ports {rg_leakage_table_2[3]}]
set_input_transition -min 1  [get_ports {rg_leakage_table_2[3]}]
set_input_transition -max 1  [get_ports {rg_leakage_table_2[2]}]
set_input_transition -min 1  [get_ports {rg_leakage_table_2[2]}]
set_input_transition -max 1  [get_ports {rg_leakage_table_2[1]}]
set_input_transition -min 1  [get_ports {rg_leakage_table_2[1]}]
set_input_transition -max 1  [get_ports {rg_leakage_table_2[0]}]
set_input_transition -min 1  [get_ports {rg_leakage_table_2[0]}]
set_input_transition -max 1  [get_ports {rg_leakage_table_3[7]}]
set_input_transition -min 1  [get_ports {rg_leakage_table_3[7]}]
set_input_transition -max 1  [get_ports {rg_leakage_table_3[6]}]
set_input_transition -min 1  [get_ports {rg_leakage_table_3[6]}]
set_input_transition -max 1  [get_ports {rg_leakage_table_3[5]}]
set_input_transition -min 1  [get_ports {rg_leakage_table_3[5]}]
set_input_transition -max 1  [get_ports {rg_leakage_table_3[4]}]
set_input_transition -min 1  [get_ports {rg_leakage_table_3[4]}]
set_input_transition -max 1  [get_ports {rg_leakage_table_3[3]}]
set_input_transition -min 1  [get_ports {rg_leakage_table_3[3]}]
set_input_transition -max 1  [get_ports {rg_leakage_table_3[2]}]
set_input_transition -min 1  [get_ports {rg_leakage_table_3[2]}]
set_input_transition -max 1  [get_ports {rg_leakage_table_3[1]}]
set_input_transition -min 1  [get_ports {rg_leakage_table_3[1]}]
set_input_transition -max 1  [get_ports {rg_leakage_table_3[0]}]
set_input_transition -min 1  [get_ports {rg_leakage_table_3[0]}]
set_input_transition -max 1  [get_ports {rg_leakage_table_4[7]}]
set_input_transition -min 1  [get_ports {rg_leakage_table_4[7]}]
set_input_transition -max 1  [get_ports {rg_leakage_table_4[6]}]
set_input_transition -min 1  [get_ports {rg_leakage_table_4[6]}]
set_input_transition -max 1  [get_ports {rg_leakage_table_4[5]}]
set_input_transition -min 1  [get_ports {rg_leakage_table_4[5]}]
set_input_transition -max 1  [get_ports {rg_leakage_table_4[4]}]
set_input_transition -min 1  [get_ports {rg_leakage_table_4[4]}]
set_input_transition -max 1  [get_ports {rg_leakage_table_4[3]}]
set_input_transition -min 1  [get_ports {rg_leakage_table_4[3]}]
set_input_transition -max 1  [get_ports {rg_leakage_table_4[2]}]
set_input_transition -min 1  [get_ports {rg_leakage_table_4[2]}]
set_input_transition -max 1  [get_ports {rg_leakage_table_4[1]}]
set_input_transition -min 1  [get_ports {rg_leakage_table_4[1]}]
set_input_transition -max 1  [get_ports {rg_leakage_table_4[0]}]
set_input_transition -min 1  [get_ports {rg_leakage_table_4[0]}]
set_input_transition -max 1  [get_ports {rg_leakage_table_5[7]}]
set_input_transition -min 1  [get_ports {rg_leakage_table_5[7]}]
set_input_transition -max 1  [get_ports {rg_leakage_table_5[6]}]
set_input_transition -min 1  [get_ports {rg_leakage_table_5[6]}]
set_input_transition -max 1  [get_ports {rg_leakage_table_5[5]}]
set_input_transition -min 1  [get_ports {rg_leakage_table_5[5]}]
set_input_transition -max 1  [get_ports {rg_leakage_table_5[4]}]
set_input_transition -min 1  [get_ports {rg_leakage_table_5[4]}]
set_input_transition -max 1  [get_ports {rg_leakage_table_5[3]}]
set_input_transition -min 1  [get_ports {rg_leakage_table_5[3]}]
set_input_transition -max 1  [get_ports {rg_leakage_table_5[2]}]
set_input_transition -min 1  [get_ports {rg_leakage_table_5[2]}]
set_input_transition -max 1  [get_ports {rg_leakage_table_5[1]}]
set_input_transition -min 1  [get_ports {rg_leakage_table_5[1]}]
set_input_transition -max 1  [get_ports {rg_leakage_table_5[0]}]
set_input_transition -min 1  [get_ports {rg_leakage_table_5[0]}]
set_input_transition -max 1  [get_ports {rg_leakage_table_6[7]}]
set_input_transition -min 1  [get_ports {rg_leakage_table_6[7]}]
set_input_transition -max 1  [get_ports {rg_leakage_table_6[6]}]
set_input_transition -min 1  [get_ports {rg_leakage_table_6[6]}]
set_input_transition -max 1  [get_ports {rg_leakage_table_6[5]}]
set_input_transition -min 1  [get_ports {rg_leakage_table_6[5]}]
set_input_transition -max 1  [get_ports {rg_leakage_table_6[4]}]
set_input_transition -min 1  [get_ports {rg_leakage_table_6[4]}]
set_input_transition -max 1  [get_ports {rg_leakage_table_6[3]}]
set_input_transition -min 1  [get_ports {rg_leakage_table_6[3]}]
set_input_transition -max 1  [get_ports {rg_leakage_table_6[2]}]
set_input_transition -min 1  [get_ports {rg_leakage_table_6[2]}]
set_input_transition -max 1  [get_ports {rg_leakage_table_6[1]}]
set_input_transition -min 1  [get_ports {rg_leakage_table_6[1]}]
set_input_transition -max 1  [get_ports {rg_leakage_table_6[0]}]
set_input_transition -min 1  [get_ports {rg_leakage_table_6[0]}]
set_input_transition -max 1  [get_ports {rg_leakage_table_7[7]}]
set_input_transition -min 1  [get_ports {rg_leakage_table_7[7]}]
set_input_transition -max 1  [get_ports {rg_leakage_table_7[6]}]
set_input_transition -min 1  [get_ports {rg_leakage_table_7[6]}]
set_input_transition -max 1  [get_ports {rg_leakage_table_7[5]}]
set_input_transition -min 1  [get_ports {rg_leakage_table_7[5]}]
set_input_transition -max 1  [get_ports {rg_leakage_table_7[4]}]
set_input_transition -min 1  [get_ports {rg_leakage_table_7[4]}]
set_input_transition -max 1  [get_ports {rg_leakage_table_7[3]}]
set_input_transition -min 1  [get_ports {rg_leakage_table_7[3]}]
set_input_transition -max 1  [get_ports {rg_leakage_table_7[2]}]
set_input_transition -min 1  [get_ports {rg_leakage_table_7[2]}]
set_input_transition -max 1  [get_ports {rg_leakage_table_7[1]}]
set_input_transition -min 1  [get_ports {rg_leakage_table_7[1]}]
set_input_transition -max 1  [get_ports {rg_leakage_table_7[0]}]
set_input_transition -min 1  [get_ports {rg_leakage_table_7[0]}]
set_input_transition -max 1  [get_ports {rg_sin_table_0[7]}]
set_input_transition -min 1  [get_ports {rg_sin_table_0[7]}]
set_input_transition -max 1  [get_ports {rg_sin_table_0[6]}]
set_input_transition -min 1  [get_ports {rg_sin_table_0[6]}]
set_input_transition -max 1  [get_ports {rg_sin_table_0[5]}]
set_input_transition -min 1  [get_ports {rg_sin_table_0[5]}]
set_input_transition -max 1  [get_ports {rg_sin_table_0[4]}]
set_input_transition -min 1  [get_ports {rg_sin_table_0[4]}]
set_input_transition -max 1  [get_ports {rg_sin_table_0[3]}]
set_input_transition -min 1  [get_ports {rg_sin_table_0[3]}]
set_input_transition -max 1  [get_ports {rg_sin_table_0[2]}]
set_input_transition -min 1  [get_ports {rg_sin_table_0[2]}]
set_input_transition -max 1  [get_ports {rg_sin_table_0[1]}]
set_input_transition -min 1  [get_ports {rg_sin_table_0[1]}]
set_input_transition -max 1  [get_ports {rg_sin_table_0[0]}]
set_input_transition -min 1  [get_ports {rg_sin_table_0[0]}]
set_input_transition -max 1  [get_ports {rg_sin_table_1[7]}]
set_input_transition -min 1  [get_ports {rg_sin_table_1[7]}]
set_input_transition -max 1  [get_ports {rg_sin_table_1[6]}]
set_input_transition -min 1  [get_ports {rg_sin_table_1[6]}]
set_input_transition -max 1  [get_ports {rg_sin_table_1[5]}]
set_input_transition -min 1  [get_ports {rg_sin_table_1[5]}]
set_input_transition -max 1  [get_ports {rg_sin_table_1[4]}]
set_input_transition -min 1  [get_ports {rg_sin_table_1[4]}]
set_input_transition -max 1  [get_ports {rg_sin_table_1[3]}]
set_input_transition -min 1  [get_ports {rg_sin_table_1[3]}]
set_input_transition -max 1  [get_ports {rg_sin_table_1[2]}]
set_input_transition -min 1  [get_ports {rg_sin_table_1[2]}]
set_input_transition -max 1  [get_ports {rg_sin_table_1[1]}]
set_input_transition -min 1  [get_ports {rg_sin_table_1[1]}]
set_input_transition -max 1  [get_ports {rg_sin_table_1[0]}]
set_input_transition -min 1  [get_ports {rg_sin_table_1[0]}]
set_input_transition -max 1  [get_ports {rg_sin_table_2[7]}]
set_input_transition -min 1  [get_ports {rg_sin_table_2[7]}]
set_input_transition -max 1  [get_ports {rg_sin_table_2[6]}]
set_input_transition -min 1  [get_ports {rg_sin_table_2[6]}]
set_input_transition -max 1  [get_ports {rg_sin_table_2[5]}]
set_input_transition -min 1  [get_ports {rg_sin_table_2[5]}]
set_input_transition -max 1  [get_ports {rg_sin_table_2[4]}]
set_input_transition -min 1  [get_ports {rg_sin_table_2[4]}]
set_input_transition -max 1  [get_ports {rg_sin_table_2[3]}]
set_input_transition -min 1  [get_ports {rg_sin_table_2[3]}]
set_input_transition -max 1  [get_ports {rg_sin_table_2[2]}]
set_input_transition -min 1  [get_ports {rg_sin_table_2[2]}]
set_input_transition -max 1  [get_ports {rg_sin_table_2[1]}]
set_input_transition -min 1  [get_ports {rg_sin_table_2[1]}]
set_input_transition -max 1  [get_ports {rg_sin_table_2[0]}]
set_input_transition -min 1  [get_ports {rg_sin_table_2[0]}]
set_input_transition -max 1  [get_ports {rg_sin_table_3[7]}]
set_input_transition -min 1  [get_ports {rg_sin_table_3[7]}]
set_input_transition -max 1  [get_ports {rg_sin_table_3[6]}]
set_input_transition -min 1  [get_ports {rg_sin_table_3[6]}]
set_input_transition -max 1  [get_ports {rg_sin_table_3[5]}]
set_input_transition -min 1  [get_ports {rg_sin_table_3[5]}]
set_input_transition -max 1  [get_ports {rg_sin_table_3[4]}]
set_input_transition -min 1  [get_ports {rg_sin_table_3[4]}]
set_input_transition -max 1  [get_ports {rg_sin_table_3[3]}]
set_input_transition -min 1  [get_ports {rg_sin_table_3[3]}]
set_input_transition -max 1  [get_ports {rg_sin_table_3[2]}]
set_input_transition -min 1  [get_ports {rg_sin_table_3[2]}]
set_input_transition -max 1  [get_ports {rg_sin_table_3[1]}]
set_input_transition -min 1  [get_ports {rg_sin_table_3[1]}]
set_input_transition -max 1  [get_ports {rg_sin_table_3[0]}]
set_input_transition -min 1  [get_ports {rg_sin_table_3[0]}]
set_input_transition -max 1  [get_ports {rg_sin_table_4[7]}]
set_input_transition -min 1  [get_ports {rg_sin_table_4[7]}]
set_input_transition -max 1  [get_ports {rg_sin_table_4[6]}]
set_input_transition -min 1  [get_ports {rg_sin_table_4[6]}]
set_input_transition -max 1  [get_ports {rg_sin_table_4[5]}]
set_input_transition -min 1  [get_ports {rg_sin_table_4[5]}]
set_input_transition -max 1  [get_ports {rg_sin_table_4[4]}]
set_input_transition -min 1  [get_ports {rg_sin_table_4[4]}]
set_input_transition -max 1  [get_ports {rg_sin_table_4[3]}]
set_input_transition -min 1  [get_ports {rg_sin_table_4[3]}]
set_input_transition -max 1  [get_ports {rg_sin_table_4[2]}]
set_input_transition -min 1  [get_ports {rg_sin_table_4[2]}]
set_input_transition -max 1  [get_ports {rg_sin_table_4[1]}]
set_input_transition -min 1  [get_ports {rg_sin_table_4[1]}]
set_input_transition -max 1  [get_ports {rg_sin_table_4[0]}]
set_input_transition -min 1  [get_ports {rg_sin_table_4[0]}]
set_input_transition -max 1  [get_ports {rg_sin_table_5[7]}]
set_input_transition -min 1  [get_ports {rg_sin_table_5[7]}]
set_input_transition -max 1  [get_ports {rg_sin_table_5[6]}]
set_input_transition -min 1  [get_ports {rg_sin_table_5[6]}]
set_input_transition -max 1  [get_ports {rg_sin_table_5[5]}]
set_input_transition -min 1  [get_ports {rg_sin_table_5[5]}]
set_input_transition -max 1  [get_ports {rg_sin_table_5[4]}]
set_input_transition -min 1  [get_ports {rg_sin_table_5[4]}]
set_input_transition -max 1  [get_ports {rg_sin_table_5[3]}]
set_input_transition -min 1  [get_ports {rg_sin_table_5[3]}]
set_input_transition -max 1  [get_ports {rg_sin_table_5[2]}]
set_input_transition -min 1  [get_ports {rg_sin_table_5[2]}]
set_input_transition -max 1  [get_ports {rg_sin_table_5[1]}]
set_input_transition -min 1  [get_ports {rg_sin_table_5[1]}]
set_input_transition -max 1  [get_ports {rg_sin_table_5[0]}]
set_input_transition -min 1  [get_ports {rg_sin_table_5[0]}]
set_input_transition -max 1  [get_ports {rg_sin_table_6[7]}]
set_input_transition -min 1  [get_ports {rg_sin_table_6[7]}]
set_input_transition -max 1  [get_ports {rg_sin_table_6[6]}]
set_input_transition -min 1  [get_ports {rg_sin_table_6[6]}]
set_input_transition -max 1  [get_ports {rg_sin_table_6[5]}]
set_input_transition -min 1  [get_ports {rg_sin_table_6[5]}]
set_input_transition -max 1  [get_ports {rg_sin_table_6[4]}]
set_input_transition -min 1  [get_ports {rg_sin_table_6[4]}]
set_input_transition -max 1  [get_ports {rg_sin_table_6[3]}]
set_input_transition -min 1  [get_ports {rg_sin_table_6[3]}]
set_input_transition -max 1  [get_ports {rg_sin_table_6[2]}]
set_input_transition -min 1  [get_ports {rg_sin_table_6[2]}]
set_input_transition -max 1  [get_ports {rg_sin_table_6[1]}]
set_input_transition -min 1  [get_ports {rg_sin_table_6[1]}]
set_input_transition -max 1  [get_ports {rg_sin_table_6[0]}]
set_input_transition -min 1  [get_ports {rg_sin_table_6[0]}]
set_input_transition -max 1  [get_ports {rg_sin_table_7[7]}]
set_input_transition -min 1  [get_ports {rg_sin_table_7[7]}]
set_input_transition -max 1  [get_ports {rg_sin_table_7[6]}]
set_input_transition -min 1  [get_ports {rg_sin_table_7[6]}]
set_input_transition -max 1  [get_ports {rg_sin_table_7[5]}]
set_input_transition -min 1  [get_ports {rg_sin_table_7[5]}]
set_input_transition -max 1  [get_ports {rg_sin_table_7[4]}]
set_input_transition -min 1  [get_ports {rg_sin_table_7[4]}]
set_input_transition -max 1  [get_ports {rg_sin_table_7[3]}]
set_input_transition -min 1  [get_ports {rg_sin_table_7[3]}]
set_input_transition -max 1  [get_ports {rg_sin_table_7[2]}]
set_input_transition -min 1  [get_ports {rg_sin_table_7[2]}]
set_input_transition -max 1  [get_ports {rg_sin_table_7[1]}]
set_input_transition -min 1  [get_ports {rg_sin_table_7[1]}]
set_input_transition -max 1  [get_ports {rg_sin_table_7[0]}]
set_input_transition -min 1  [get_ports {rg_sin_table_7[0]}]
set_input_transition -max 1  [get_ports {rg_cos_table_0[7]}]
set_input_transition -min 1  [get_ports {rg_cos_table_0[7]}]
set_input_transition -max 1  [get_ports {rg_cos_table_0[6]}]
set_input_transition -min 1  [get_ports {rg_cos_table_0[6]}]
set_input_transition -max 1  [get_ports {rg_cos_table_0[5]}]
set_input_transition -min 1  [get_ports {rg_cos_table_0[5]}]
set_input_transition -max 1  [get_ports {rg_cos_table_0[4]}]
set_input_transition -min 1  [get_ports {rg_cos_table_0[4]}]
set_input_transition -max 1  [get_ports {rg_cos_table_0[3]}]
set_input_transition -min 1  [get_ports {rg_cos_table_0[3]}]
set_input_transition -max 1  [get_ports {rg_cos_table_0[2]}]
set_input_transition -min 1  [get_ports {rg_cos_table_0[2]}]
set_input_transition -max 1  [get_ports {rg_cos_table_0[1]}]
set_input_transition -min 1  [get_ports {rg_cos_table_0[1]}]
set_input_transition -max 1  [get_ports {rg_cos_table_0[0]}]
set_input_transition -min 1  [get_ports {rg_cos_table_0[0]}]
set_input_transition -max 1  [get_ports {rg_cos_table_1[7]}]
set_input_transition -min 1  [get_ports {rg_cos_table_1[7]}]
set_input_transition -max 1  [get_ports {rg_cos_table_1[6]}]
set_input_transition -min 1  [get_ports {rg_cos_table_1[6]}]
set_input_transition -max 1  [get_ports {rg_cos_table_1[5]}]
set_input_transition -min 1  [get_ports {rg_cos_table_1[5]}]
set_input_transition -max 1  [get_ports {rg_cos_table_1[4]}]
set_input_transition -min 1  [get_ports {rg_cos_table_1[4]}]
set_input_transition -max 1  [get_ports {rg_cos_table_1[3]}]
set_input_transition -min 1  [get_ports {rg_cos_table_1[3]}]
set_input_transition -max 1  [get_ports {rg_cos_table_1[2]}]
set_input_transition -min 1  [get_ports {rg_cos_table_1[2]}]
set_input_transition -max 1  [get_ports {rg_cos_table_1[1]}]
set_input_transition -min 1  [get_ports {rg_cos_table_1[1]}]
set_input_transition -max 1  [get_ports {rg_cos_table_1[0]}]
set_input_transition -min 1  [get_ports {rg_cos_table_1[0]}]
set_input_transition -max 1  [get_ports {rg_cos_table_2[7]}]
set_input_transition -min 1  [get_ports {rg_cos_table_2[7]}]
set_input_transition -max 1  [get_ports {rg_cos_table_2[6]}]
set_input_transition -min 1  [get_ports {rg_cos_table_2[6]}]
set_input_transition -max 1  [get_ports {rg_cos_table_2[5]}]
set_input_transition -min 1  [get_ports {rg_cos_table_2[5]}]
set_input_transition -max 1  [get_ports {rg_cos_table_2[4]}]
set_input_transition -min 1  [get_ports {rg_cos_table_2[4]}]
set_input_transition -max 1  [get_ports {rg_cos_table_2[3]}]
set_input_transition -min 1  [get_ports {rg_cos_table_2[3]}]
set_input_transition -max 1  [get_ports {rg_cos_table_2[2]}]
set_input_transition -min 1  [get_ports {rg_cos_table_2[2]}]
set_input_transition -max 1  [get_ports {rg_cos_table_2[1]}]
set_input_transition -min 1  [get_ports {rg_cos_table_2[1]}]
set_input_transition -max 1  [get_ports {rg_cos_table_2[0]}]
set_input_transition -min 1  [get_ports {rg_cos_table_2[0]}]
set_input_transition -max 1  [get_ports {rg_cos_table_3[7]}]
set_input_transition -min 1  [get_ports {rg_cos_table_3[7]}]
set_input_transition -max 1  [get_ports {rg_cos_table_3[6]}]
set_input_transition -min 1  [get_ports {rg_cos_table_3[6]}]
set_input_transition -max 1  [get_ports {rg_cos_table_3[5]}]
set_input_transition -min 1  [get_ports {rg_cos_table_3[5]}]
set_input_transition -max 1  [get_ports {rg_cos_table_3[4]}]
set_input_transition -min 1  [get_ports {rg_cos_table_3[4]}]
set_input_transition -max 1  [get_ports {rg_cos_table_3[3]}]
set_input_transition -min 1  [get_ports {rg_cos_table_3[3]}]
set_input_transition -max 1  [get_ports {rg_cos_table_3[2]}]
set_input_transition -min 1  [get_ports {rg_cos_table_3[2]}]
set_input_transition -max 1  [get_ports {rg_cos_table_3[1]}]
set_input_transition -min 1  [get_ports {rg_cos_table_3[1]}]
set_input_transition -max 1  [get_ports {rg_cos_table_3[0]}]
set_input_transition -min 1  [get_ports {rg_cos_table_3[0]}]
set_input_transition -max 1  [get_ports {rg_cos_table_4[7]}]
set_input_transition -min 1  [get_ports {rg_cos_table_4[7]}]
set_input_transition -max 1  [get_ports {rg_cos_table_4[6]}]
set_input_transition -min 1  [get_ports {rg_cos_table_4[6]}]
set_input_transition -max 1  [get_ports {rg_cos_table_4[5]}]
set_input_transition -min 1  [get_ports {rg_cos_table_4[5]}]
set_input_transition -max 1  [get_ports {rg_cos_table_4[4]}]
set_input_transition -min 1  [get_ports {rg_cos_table_4[4]}]
set_input_transition -max 1  [get_ports {rg_cos_table_4[3]}]
set_input_transition -min 1  [get_ports {rg_cos_table_4[3]}]
set_input_transition -max 1  [get_ports {rg_cos_table_4[2]}]
set_input_transition -min 1  [get_ports {rg_cos_table_4[2]}]
set_input_transition -max 1  [get_ports {rg_cos_table_4[1]}]
set_input_transition -min 1  [get_ports {rg_cos_table_4[1]}]
set_input_transition -max 1  [get_ports {rg_cos_table_4[0]}]
set_input_transition -min 1  [get_ports {rg_cos_table_4[0]}]
set_input_transition -max 1  [get_ports {rg_cos_table_5[7]}]
set_input_transition -min 1  [get_ports {rg_cos_table_5[7]}]
set_input_transition -max 1  [get_ports {rg_cos_table_5[6]}]
set_input_transition -min 1  [get_ports {rg_cos_table_5[6]}]
set_input_transition -max 1  [get_ports {rg_cos_table_5[5]}]
set_input_transition -min 1  [get_ports {rg_cos_table_5[5]}]
set_input_transition -max 1  [get_ports {rg_cos_table_5[4]}]
set_input_transition -min 1  [get_ports {rg_cos_table_5[4]}]
set_input_transition -max 1  [get_ports {rg_cos_table_5[3]}]
set_input_transition -min 1  [get_ports {rg_cos_table_5[3]}]
set_input_transition -max 1  [get_ports {rg_cos_table_5[2]}]
set_input_transition -min 1  [get_ports {rg_cos_table_5[2]}]
set_input_transition -max 1  [get_ports {rg_cos_table_5[1]}]
set_input_transition -min 1  [get_ports {rg_cos_table_5[1]}]
set_input_transition -max 1  [get_ports {rg_cos_table_5[0]}]
set_input_transition -min 1  [get_ports {rg_cos_table_5[0]}]
set_input_transition -max 1  [get_ports {rg_cos_table_6[7]}]
set_input_transition -min 1  [get_ports {rg_cos_table_6[7]}]
set_input_transition -max 1  [get_ports {rg_cos_table_6[6]}]
set_input_transition -min 1  [get_ports {rg_cos_table_6[6]}]
set_input_transition -max 1  [get_ports {rg_cos_table_6[5]}]
set_input_transition -min 1  [get_ports {rg_cos_table_6[5]}]
set_input_transition -max 1  [get_ports {rg_cos_table_6[4]}]
set_input_transition -min 1  [get_ports {rg_cos_table_6[4]}]
set_input_transition -max 1  [get_ports {rg_cos_table_6[3]}]
set_input_transition -min 1  [get_ports {rg_cos_table_6[3]}]
set_input_transition -max 1  [get_ports {rg_cos_table_6[2]}]
set_input_transition -min 1  [get_ports {rg_cos_table_6[2]}]
set_input_transition -max 1  [get_ports {rg_cos_table_6[1]}]
set_input_transition -min 1  [get_ports {rg_cos_table_6[1]}]
set_input_transition -max 1  [get_ports {rg_cos_table_6[0]}]
set_input_transition -min 1  [get_ports {rg_cos_table_6[0]}]
set_input_transition -max 1  [get_ports {rg_cos_table_7[7]}]
set_input_transition -min 1  [get_ports {rg_cos_table_7[7]}]
set_input_transition -max 1  [get_ports {rg_cos_table_7[6]}]
set_input_transition -min 1  [get_ports {rg_cos_table_7[6]}]
set_input_transition -max 1  [get_ports {rg_cos_table_7[5]}]
set_input_transition -min 1  [get_ports {rg_cos_table_7[5]}]
set_input_transition -max 1  [get_ports {rg_cos_table_7[4]}]
set_input_transition -min 1  [get_ports {rg_cos_table_7[4]}]
set_input_transition -max 1  [get_ports {rg_cos_table_7[3]}]
set_input_transition -min 1  [get_ports {rg_cos_table_7[3]}]
set_input_transition -max 1  [get_ports {rg_cos_table_7[2]}]
set_input_transition -min 1  [get_ports {rg_cos_table_7[2]}]
set_input_transition -max 1  [get_ports {rg_cos_table_7[1]}]
set_input_transition -min 1  [get_ports {rg_cos_table_7[1]}]
set_input_transition -max 1  [get_ports {rg_cos_table_7[0]}]
set_input_transition -min 1  [get_ports {rg_cos_table_7[0]}]
set_input_transition -max 1  [get_ports {valid_num[2]}]
set_input_transition -min 1  [get_ports {valid_num[2]}]
set_input_transition -max 1  [get_ports {valid_num[1]}]
set_input_transition -min 1  [get_ports {valid_num[1]}]
set_input_transition -max 1  [get_ports {valid_num[0]}]
set_input_transition -min 1  [get_ports {valid_num[0]}]
set_input_transition -max 1  [get_ports vin_vld]
set_input_transition -min 1  [get_ports vin_vld]
set_input_transition -max 1  [get_ports {vin1[7]}]
set_input_transition -min 1  [get_ports {vin1[7]}]
set_input_transition -max 1  [get_ports {vin1[6]}]
set_input_transition -min 1  [get_ports {vin1[6]}]
set_input_transition -max 1  [get_ports {vin1[5]}]
set_input_transition -min 1  [get_ports {vin1[5]}]
set_input_transition -max 1  [get_ports {vin1[4]}]
set_input_transition -min 1  [get_ports {vin1[4]}]
set_input_transition -max 1  [get_ports {vin1[3]}]
set_input_transition -min 1  [get_ports {vin1[3]}]
set_input_transition -max 1  [get_ports {vin1[2]}]
set_input_transition -min 1  [get_ports {vin1[2]}]
set_input_transition -max 1  [get_ports {vin1[1]}]
set_input_transition -min 1  [get_ports {vin1[1]}]
set_input_transition -max 1  [get_ports {vin1[0]}]
set_input_transition -min 1  [get_ports {vin1[0]}]
set_input_transition -max 1  [get_ports {vin2[7]}]
set_input_transition -min 1  [get_ports {vin2[7]}]
set_input_transition -max 1  [get_ports {vin2[6]}]
set_input_transition -min 1  [get_ports {vin2[6]}]
set_input_transition -max 1  [get_ports {vin2[5]}]
set_input_transition -min 1  [get_ports {vin2[5]}]
set_input_transition -max 1  [get_ports {vin2[4]}]
set_input_transition -min 1  [get_ports {vin2[4]}]
set_input_transition -max 1  [get_ports {vin2[3]}]
set_input_transition -min 1  [get_ports {vin2[3]}]
set_input_transition -max 1  [get_ports {vin2[2]}]
set_input_transition -min 1  [get_ports {vin2[2]}]
set_input_transition -max 1  [get_ports {vin2[1]}]
set_input_transition -min 1  [get_ports {vin2[1]}]
set_input_transition -max 1  [get_ports {vin2[0]}]
set_input_transition -min 1  [get_ports {vin2[0]}]
set_input_transition -max 1  [get_ports resetn]
set_input_transition -min 1  [get_ports resetn]
set_clock_gating_check -rise -setup 0 [get_cells                               \
cordic/clk_gate_yn_reg/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
cordic/clk_gate_yn_reg/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
cordic/clk_gate_yn_reg/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
cordic/clk_gate_yn_reg/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
cordic/clk_gate_res_rg_reg/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
cordic/clk_gate_res_rg_reg/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
cordic/clk_gate_res_rg_reg/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
cordic/clk_gate_res_rg_reg/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
cordic/clk_gate_cal_cnt_reg/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
cordic/clk_gate_cal_cnt_reg/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
cordic/clk_gate_cal_cnt_reg/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
cordic/clk_gate_cal_cnt_reg/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
dot/clk_gate_psum2_reg/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
dot/clk_gate_psum2_reg/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
dot/clk_gate_psum2_reg/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
dot/clk_gate_psum2_reg/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
calvn/clk_gate_v_cnt_reg/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
calvn/clk_gate_v_cnt_reg/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
calvn/clk_gate_v_cnt_reg/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
calvn/clk_gate_v_cnt_reg/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
calvn/clk_gate_Vins_1_reg/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
calvn/clk_gate_Vins_1_reg/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
calvn/clk_gate_Vins_1_reg/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
calvn/clk_gate_Vins_1_reg/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
calvn/clk_gate_Vins_3_reg/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
calvn/clk_gate_Vins_3_reg/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
calvn/clk_gate_Vins_3_reg/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
calvn/clk_gate_Vins_3_reg/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
calvn/clk_gate_Vins_4_reg/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
calvn/clk_gate_Vins_4_reg/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
calvn/clk_gate_Vins_4_reg/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
calvn/clk_gate_Vins_4_reg/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
calvn/clk_gate_Vins_6_reg/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
calvn/clk_gate_Vins_6_reg/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
calvn/clk_gate_Vins_6_reg/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
calvn/clk_gate_Vins_6_reg/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
calvn/clk_gate_max_v_reg/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
calvn/clk_gate_max_v_reg/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
calvn/clk_gate_max_v_reg/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
calvn/clk_gate_max_v_reg/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
calvn/clk_gate_min_v_reg/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
calvn/clk_gate_min_v_reg/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
calvn/clk_gate_min_v_reg/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
calvn/clk_gate_min_v_reg/main_gate]
